stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32u3xx_ll_pwr.h
  * @author  GPM Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U3xx_LL_PWR_H
#define STM32U3xx_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx.h"

/** @addtogroup STM32U3xx_LL_Driver
  * @{
  */

#if defined (PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
#define LL_PWR_SR_CSSF                 PWR_SR_CSSF                   /*!< Clear Stop and Standby flags */
#define LL_PWR_WUSCR_CWUF1             PWR_WUSCR_CWUF1               /*!< Clear Wakeup flag 1          */
#define LL_PWR_WUSCR_CWUF2             PWR_WUSCR_CWUF2               /*!< Clear Wakeup flag 2          */
#define LL_PWR_WUSCR_CWUF3             PWR_WUSCR_CWUF3               /*!< Clear Wakeup flag 3          */
#define LL_PWR_WUSCR_CWUF4             PWR_WUSCR_CWUF4               /*!< Clear Wakeup flag 4          */
#define LL_PWR_WUSCR_CWUF5             PWR_WUSCR_CWUF5               /*!< Clear Wakeup flag 5          */
#define LL_PWR_WUSCR_CWUF6             PWR_WUSCR_CWUF6               /*!< Clear Wakeup flag 6          */
#define LL_PWR_WUSCR_CWUF7             PWR_WUSCR_CWUF7               /*!< Clear Wakeup flag 7          */
#define LL_PWR_WUSCR_CWUF8             PWR_WUSCR_CWUF8               /*!< Clear Wakeup flag 8          */
#define LL_PWR_WUSCR_CWUF9             PWR_WUSCR_CWUF9               /*!< Clear Wakeup flag 9          */
#define LL_PWR_WUSCR_CWUF10            PWR_WUSCR_CWUF10              /*!< Clear Wakeup flag 10         */
#define LL_PWR_WUSCR_CWUF_ALL         (PWR_WUSCR_CWUF1 | PWR_WUSCR_CWUF2 | PWR_WUSCR_CWUF3 | PWR_WUSCR_CWUF4 |\
                                       PWR_WUSCR_CWUF5 | PWR_WUSCR_CWUF6 | PWR_WUSCR_CWUF7 | PWR_WUSCR_CWUF8 |\
                                       PWR_WUSCR_CWUF9 | PWR_WUSCR_CWUF10)
/*!< Clear all Wakeup flags       */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_ReadReg function
  * @{
  */
#define LL_PWR_FLAG_STOPF              PWR_SR_STOPF                  /*!< Stop flag                                   */
#define LL_PWR_FLAG_SBF                PWR_SR_SBF                    /*!< Standby flag                                */
#define LL_PWR_FLAG_R1RDY              PWR_VOSR_R1RDY                /*!< Voltage range 1 selection ready flag        */
#define LL_PWR_FLAG_R2RDY              PWR_VOSR_R2RDY                /*!< Voltage range 2 selection ready flag        */
#define LL_PWR_FLAG_BOOSTRDY           PWR_VOSR_BOOSTRDY             /*!< EPOD booster ready flag                     */
#define LL_PWR_FLAG_PVDO               PWR_SVMSR_PVDO                /*!< VDD voltage detector output flag            */
#define LL_PWR_FLAG_REGS               PWR_SVMSR_REGS                /*!< Regulator selection flag                    */
#define LL_PWR_FLAG_VDDA1RDY           PWR_SVMSR_VDDA1RDY            /*!< VDDA ready versus 1.6V voltage monitor flag */
#define LL_PWR_FLAG_VDDA2RDY           PWR_SVMSR_VDDA2RDY            /*!< VDDA ready versus 1.8V voltage monitor flag */
#if defined(PWR_SVMCR_IO2VMEN)
#define LL_PWR_FLAG_VDDIO2RDY          PWR_SVMSR_VDDIO2RDY           /*!< VDDIO2 ready voltage monitor flag           */
#endif /* PWR_SVMCR_IO2VMEN */
#define LL_PWR_FLAG_VDDUSBRDY          PWR_SVMSR_VDDUSBRDY           /*!< VDDUSB ready voltage monitor flag           */

#define LL_PWR_WAKEUP_FLAG1            PWR_WUSR_WUF1                 /*!< Wakeup flag 1  */
#define LL_PWR_WAKEUP_FLAG2            PWR_WUSR_WUF2                 /*!< Wakeup flag 2  */
#define LL_PWR_WAKEUP_FLAG3            PWR_WUSR_WUF3                 /*!< Wakeup flag 3  */
#define LL_PWR_WAKEUP_FLAG4            PWR_WUSR_WUF4                 /*!< Wakeup flag 4  */
#define LL_PWR_WAKEUP_FLAG5            PWR_WUSR_WUF5                 /*!< Wakeup flag 5  */
#define LL_PWR_WAKEUP_FLAG6            PWR_WUSR_WUF6                 /*!< Wakeup flag 6  */
#define LL_PWR_WAKEUP_FLAG7            PWR_WUSR_WUF7                 /*!< Wakeup flag 7  */
#define LL_PWR_WAKEUP_FLAG8            PWR_WUSR_WUF8                 /*!< Wakeup flag 8  */
#define LL_PWR_WAKEUP_FLAG9            PWR_WUSR_WUF9                 /*!< Wakeup flag 9  */
#define LL_PWR_WAKEUP_FLAG10           PWR_WUSR_WUF10                /*!< Wakeup flag 10 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_LINE PWR Wake Up Line
  * @{
  */
#define LL_PWR_WAKEUP_LINE1            PWR_WUCR1_WUPEN1                        /*!< Wakeup line 1 enable  */
#define LL_PWR_WAKEUP_LINE2            PWR_WUCR1_WUPEN2                        /*!< Wakeup line 2 enable  */
#define LL_PWR_WAKEUP_LINE3            PWR_WUCR1_WUPEN3                        /*!< Wakeup line 3 enable  */
#define LL_PWR_WAKEUP_LINE4            PWR_WUCR1_WUPEN4                        /*!< Wakeup line 4 enable  */
#define LL_PWR_WAKEUP_LINE5            PWR_WUCR1_WUPEN5                        /*!< Wakeup line 5 enable  */
#define LL_PWR_WAKEUP_LINE6            PWR_WUCR1_WUPEN6                        /*!< Wakeup line 6 enable  */
#define LL_PWR_WAKEUP_LINE7            PWR_WUCR1_WUPEN7                        /*!< Wakeup line 7 enable  */
#define LL_PWR_WAKEUP_LINE8            PWR_WUCR1_WUPEN8                        /*!< Wakeup line 8 enable  */
#define LL_PWR_WAKEUP_LINE9            PWR_WUCR1_WUPEN9                        /*!< Wakeup line 9 enable  */
#define LL_PWR_WAKEUP_LINE10           PWR_WUCR1_WUPEN10                       /*!< Wakeup line 10 enable */
/**
  * @}
  */

