stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_pwr.h
/** @defgroup PWR_LL_EC_WAKEUP_LINE_SELECTION PWR Wakeup line Selection
  * @{
  */
#define LL_PWR_WAKEUP_LINE_SELECTION_0  (0UL)                                  /*!< Wakeup line selection 0 */
#define LL_PWR_WAKEUP_LINE_SELECTION_1  PWR_WUCR3_WUSEL1_0                     /*!< Wakeup line selection 1 */
#define LL_PWR_WAKEUP_LINE_SELECTION_2  PWR_WUCR3_WUSEL1_1                     /*!< Wakeup line selection 2 */
#define LL_PWR_WAKEUP_LINE_SELECTION_3  PWR_WUCR3_WUSEL1                       /*!< Wakeup line selection 3 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_LOW_POWER_MODE_SELECTION Low Power Mode Selection
  * @{
  */
#define LL_PWR_MODE_STOP0              (0U)                                    /*!< Stop 0 mode   */
#define LL_PWR_MODE_STOP1              PWR_CR1_LPMS_0                          /*!< Stop 1 mode   */
#define LL_PWR_MODE_STOP2              PWR_CR1_LPMS_1                          /*!< Stop 2 mode   */
#define LL_PWR_MODE_STOP3              (PWR_CR1_LPMS_0 | PWR_CR1_LPMS_1)       /*!< Stop 3 mode   */
#define LL_PWR_MODE_STANDBY            PWR_CR1_LPMS_2                          /*!< Standby mode  */
#define LL_PWR_MODE_SHUTDOWN           (PWR_CR1_LPMS_2 | PWR_CR1_LPMS_1)       /*!< Shutdown mode */
/**
  * @}
  */

/** @defgroup PWR_LL_RAM_PowerDown PWR SRAM Power Down
  * @{
  */
#define LL_PWR_SRAM1_POWERDOWN         PWR_CR1_SRAM1PD                         /*!< SRAM1 power down */
#define LL_PWR_SRAM2_POWERDOWN         PWR_CR1_SRAM2PD                         /*!< SRAM2 power down */
#if defined(RAMCFG_SRAM3)
#define LL_PWR_SRAM3_POWERDOWN         PWR_CR1_SRAM3PD                         /*!< SRAM3 power down */
#define LL_PWR_SRAM4_POWERDOWN         PWR_CR1_SRAM4PD                         /*!< SRAM4 power down */
#endif /* RAMCFG_SRAM3 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM2_SB_CONTENTS_RETENTION PWR SRAM2 Content Retention in Standby Mode
  * @{
  */
#define LL_PWR_SRAM2_SB_NO_RETENTION     (0U)          /*!< SRAM2 no retention in Standby mode     */
#define LL_PWR_SRAM2_SB_PAGE1_RETENTION  PWR_CR1_RRSB1 /*!< SRAM2 page 1 retention in Standby mode */
#define LL_PWR_SRAM2_SB_PAGE2_RETENTION  PWR_CR1_RRSB2 /*!< SRAM2 page 2 retention in Standby mode */
#define LL_PWR_SRAM2_SB_PAGE3_RETENTION  PWR_CR1_RRSB3 /*!< SRAM2 page 3 retention in Standby mode */
#define LL_PWR_SRAM2_SB_FULL_RETENTION   (PWR_CR1_RRSB1 | PWR_CR1_RRSB2 | PWR_CR1_RRSB3)
/*!< SRAM2 all pages retention in Standby mode      */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM1_STOP_CONTENTS_RETENTION PWR SRAM1 Content Retention in Stop Mode
  * @{
  */
#define LL_PWR_SRAM1_STOP_NO_RETENTION     (0U)              /*!< SRAM1 no retention in Stop modes (Stop 0, 1, 2, 3)  */
#define LL_PWR_SRAM1_STOP_PAGE1_RETENTION  PWR_CR2_SRAM1PDS1 /*!< SRAM1 page 1 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM1_STOP_PAGE2_RETENTION  PWR_CR2_SRAM1PDS2 /*!< SRAM1 page 2 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM1_STOP_PAGE3_RETENTION  PWR_CR2_SRAM1PDS3 /*!< SRAM1 page 3 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM1_STOP_PAGE4_RETENTION  PWR_CR2_SRAM1PDS4 /*!< SRAM1 page 4 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM1_STOP_PAGE5_RETENTION  PWR_CR2_SRAM1PDS5 /*!< SRAM1 page 5 retention Stop modes (Stop 0, 1, 2, 3) */
#if defined(PWR_CR2_SRAM1PDS6)
#define LL_PWR_SRAM1_STOP_PAGE6_RETENTION  PWR_CR2_SRAM1PDS6 /*!< SRAM1 page 6 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM1_STOP_PAGE7_RETENTION  PWR_CR2_SRAM1PDS7 /*!< SRAM1 page 7 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM1_STOP_FULL_RETENTION   (PWR_CR2_SRAM1PDS1 | PWR_CR2_SRAM1PDS2 | PWR_CR2_SRAM1PDS3 |\
                                            PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS5 | PWR_CR2_SRAM1PDS6 |\
                                            PWR_CR2_SRAM1PDS7)
/*!< SRAM1 all pages retention in Stop modes (Stop 0, 1, 2, 3) */
#else
#define LL_PWR_SRAM1_STOP_FULL_RETENTION   (PWR_CR2_SRAM1PDS1 | PWR_CR2_SRAM1PDS2 | PWR_CR2_SRAM1PDS3 |\
                                            PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS5)
/*!< SRAM1 all pages retention in Stop modes (Stop 0, 1, 2, 3) */
#endif /* PWR_CR2_SRAM1PDS6 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM2_STOP_CONTENTS_RETENTION PWR SRAM2 Content Retention in Stop Mode
  * @{
  */
#define LL_PWR_SRAM2_STOP_NO_RETENTION     (0U)              /*!< SRAM2 no retention in Stop modes (Stop 0, 1, 2, 3)  */
#define LL_PWR_SRAM2_STOP_PAGE1_RETENTION  PWR_CR2_SRAM2PDS1 /*!< SRAM2 page 1 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM2_STOP_PAGE2_RETENTION  PWR_CR2_SRAM2PDS2 /*!< SRAM2 page 2 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM2_STOP_PAGE3_RETENTION  PWR_CR2_SRAM2PDS3 /*!< SRAM2 page 3 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM2_STOP_FULL_RETENTION   (PWR_CR2_SRAM2PDS1 | PWR_CR2_SRAM2PDS2 | PWR_CR2_SRAM2PDS3)
/*!< SRAM2 all pages retention in Stop modes (Stop 0, 1, 2, 3) */
/**
  * @}
  */

#if defined(RAMCFG_SRAM3)
/** @defgroup PWR_LL_EC_SRAM3_STOP_CONTENTS_RETENTION PWR SRAM3 Content Retention in Stop Mode
  * @{
  */
#define LL_PWR_SRAM3_STOP_NO_RETENTION     (0U)              /*!< SRAM3 no retention in Stop modes (Stop 0, 1, 2, 3)  */
#define LL_PWR_SRAM3_STOP_PAGE1_RETENTION  PWR_CR2_SRAM3PDS1 /*!< SRAM3 page 1 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM3_STOP_PAGE2_RETENTION  PWR_CR2_SRAM3PDS2 /*!< SRAM3 page 2 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM3_STOP_PAGE3_RETENTION  PWR_CR2_SRAM3PDS3 /*!< SRAM3 page 3 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM3_STOP_PAGE4_RETENTION  PWR_CR2_SRAM3PDS4 /*!< SRAM3 page 4 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM3_STOP_PAGE5_RETENTION  PWR_CR2_SRAM3PDS5 /*!< SRAM3 page 5 retention Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_SRAM3_STOP_FULL_RETENTION   (PWR_CR2_SRAM3PDS1 | PWR_CR2_SRAM3PDS2 | PWR_CR2_SRAM3PDS3 |\
                                            PWR_CR2_SRAM3PDS4 | PWR_CR2_SRAM3PDS5)
/*!< SRAM3 all pages retention in Stop modes (Stop 0, 1, 2, 3) */
/**
  * @}
  */

