stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_pwr.h
/** @defgroup PWR_LL_EC_SRAM4_STOP_CONTENTS_RETENTION PWR SRAM4 Content Retention in Stop Mode
  * @{
  */
#define LL_PWR_SRAM4_STOP_NO_RETENTION     (0U)             /*!< SRAM4 no retention in Stop modes (Stop 0, 1, 2, 3)   */
#define LL_PWR_SRAM4_STOP_FULL_RETENTION   PWR_CR2_SRAM4PDS /*!< SRAM4 full retention in Stop modes (Stop 0, 1, 2, 3) */
/**
  * @}
  */
#endif /* RAMCFG_SRAM3 */

/** @defgroup PWR_LL_EC_PKARAM_STOP_CONTENTS_RETENTION PWR PKA SRAM Content Retention in Stop Mode
  * @{
  */
#define LL_PWR_PKARAM_STOP_NO_RETENTION  (0U)              /*!< PKA SRAM no retention in Stop modes (Stop 0, 1, 2, 3) */
#define LL_PWR_PKARAM_STOP_RETENTION     PWR_CR2_PKARAMPDS /*!< PKA SRAM content retained in Stop modes
                                                                (Stop 0, 1, 2, 3) */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_FDCANUSBRAM_STOP_CONTENTS_RETENTION PWR FDCAN & USB SRAM Content Retention in Stop Mode
  * @{
  */
#define LL_PWR_FDCANUSBRAM_STOP_NO_RETENTION  (0U)            /*!< FDCAN & USB SRAM no retention in Stop modes
                                                                    (Stop 0, 1, 2, 3) */
#define LL_PWR_FDCANUSBRAM_STOP_RETENTION     PWR_CR2_PRAMPDS /*!< FDCAN & USB SRAM content retained in Stop modes
                                                                    (Stop 0, 1, 2, 3) */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_ICACHERAM_STOP_CONTENTS_RETENTION PWR ICACHE SRAM Content Retention in Stop Mode
  * @{
  */
#define LL_PWR_ICACHERAM_STOP_NO_RETENTION  (0U)             /*!< ICACHE SRAM no retention in Stop modes
                                                                  (Stop 0, 1, 2, 3)      */
#define LL_PWR_ICACHERAM_STOP_RETENTION     PWR_CR2_ICRAMPDS /*!< ICACHE SRAM content retained in Stop modes
                                                                  (Stop 0, 1, 2, 3)  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_REGULATOR_SUPPLY_SELECTION PWR Regulator Supply Selection
  * @{
  */
#define LL_PWR_LDO_SUPPLY              (0U)           /*!< LDO regulator supply  */
#define LL_PWR_SMPS_SUPPLY             PWR_CR3_REGSEL /*!< SMPS regulator supply */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_VOLTAGE_SCALING_RANGE_SELECTION PWR Voltage scaling range selection
  * @{
  */
#define LL_PWR_REGU_VOLTAGE_SCALE1     PWR_VOSR_R1EN /*!< Voltage scaling range 1 (highest frequency) */
#define LL_PWR_REGU_VOLTAGE_SCALE2     PWR_VOSR_R2EN /*!< Voltage scaling range 2 (lowest power)      */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PVD_LEVEL_SELECTION PWR Power Voltage Detector Level Selection
  * @{
  */
#define LL_PWR_PVDLEVEL_0       (0U)                                    /*!< Voltage threshold detected by PVD 2.0 V  */
#define LL_PWR_PVDLEVEL_1       PWR_SVMCR_PVDLS_0                       /*!< Voltage threshold detected by PVD 2.2 V  */
#define LL_PWR_PVDLEVEL_2       PWR_SVMCR_PVDLS_1                       /*!< Voltage threshold detected by PVD 2.4 V  */
#define LL_PWR_PVDLEVEL_3       (PWR_SVMCR_PVDLS_0 | PWR_SVMCR_PVDLS_1) /*!< Voltage threshold detected by PVD 2.5 V  */
#define LL_PWR_PVDLEVEL_4       PWR_SVMCR_PVDLS_2                       /*!< Voltage threshold detected by PVD 2.6 V  */
#define LL_PWR_PVDLEVEL_5       (PWR_SVMCR_PVDLS_0 | PWR_SVMCR_PVDLS_2) /*!< Voltage threshold detected by PVD 2.8 V  */
#define LL_PWR_PVDLEVEL_6       (PWR_SVMCR_PVDLS_1 | PWR_SVMCR_PVDLS_2) /*!< Voltage threshold detected by PVD 2.9 V  */
#define LL_PWR_PVDLEVEL_7       PWR_SVMCR_PVDLS
/*!< External input analog voltage on PVD_IN pin, compared to internal VREFINT level  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_CHARGING_RESISTOR_SELECTION PWR VBAT Charging Resistor Selection
  * @{
  */
#define LL_PWR_BATT_CHARG_RESISTOR_5K    (0U)          /*!< Charge the battery through a 5 kO resistor   */
#define LL_PWR_BATT_CHARG_RESISTOR_1_5K  PWR_BDCR_VBRS /*!< Charge the battery through a 1.5 kO resistor */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GPIO_PORT_SELECTION PWR GPIO Port Selection
  * @{
  */
#define LL_PWR_GPIO_PORTA              ((uint32_t)(&(PWR->PUCRA)))             /*!< GPIO port A */
#define LL_PWR_GPIO_PORTB              ((uint32_t)(&(PWR->PUCRB)))             /*!< GPIO port B */
#define LL_PWR_GPIO_PORTC              ((uint32_t)(&(PWR->PUCRC)))             /*!< GPIO port C */
#define LL_PWR_GPIO_PORTD              ((uint32_t)(&(PWR->PUCRD)))             /*!< GPIO port D */
#define LL_PWR_GPIO_PORTE              ((uint32_t)(&(PWR->PUCRE)))             /*!< GPIO port E */
#if defined(RAMCFG_SRAM3)
#define LL_PWR_GPIO_PORTF              ((uint32_t)(&(PWR->PUCRF)))             /*!< GPIO port F */
#endif /* RAMCFG_SRAM3 */
#define LL_PWR_GPIO_PORTG              ((uint32_t)(&(PWR->PUCRG)))             /*!< GPIO port G */
#define LL_PWR_GPIO_PORTH              ((uint32_t)(&(PWR->PUCRH)))             /*!< GPIO port H */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GPIO_PIN_MASK PWR GPIO Pin Mask
  * @{
  */
#define LL_PWR_GPIO_PIN_0              (0x0001U)                               /*!< GPIO port I/O pin 0  */
#define LL_PWR_GPIO_PIN_1              (0x0002U)                               /*!< GPIO port I/O pin 1  */
#define LL_PWR_GPIO_PIN_2              (0x0004U)                               /*!< GPIO port I/O pin 2  */
#define LL_PWR_GPIO_PIN_3              (0x0008U)                               /*!< GPIO port I/O pin 3  */
#define LL_PWR_GPIO_PIN_4              (0x0010U)                               /*!< GPIO port I/O pin 4  */
#define LL_PWR_GPIO_PIN_5              (0x0020U)                               /*!< GPIO port I/O pin 5  */
#define LL_PWR_GPIO_PIN_6              (0x0040U)                               /*!< GPIO port I/O pin 6  */
#define LL_PWR_GPIO_PIN_7              (0x0080U)                               /*!< GPIO port I/O pin 7  */
#define LL_PWR_GPIO_PIN_8              (0x0100U)                               /*!< GPIO port I/O pin 8  */
#define LL_PWR_GPIO_PIN_9              (0x0200U)                               /*!< GPIO port I/O pin 9  */
#define LL_PWR_GPIO_PIN_10             (0x0400U)                               /*!< GPIO port I/O pin 10 */
#define LL_PWR_GPIO_PIN_11             (0x0800U)                               /*!< GPIO port I/O pin 11 */
#define LL_PWR_GPIO_PIN_12             (0x1000U)                               /*!< GPIO port I/O pin 12 */
#define LL_PWR_GPIO_PIN_13             (0x2000U)                               /*!< GPIO port I/O pin 13 */
#define LL_PWR_GPIO_PIN_14             (0x4000U)                               /*!< GPIO port I/O pin 14 */
#define LL_PWR_GPIO_PIN_15             (0x8000U)                               /*!< GPIO port I/O pin 15 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_I3C_PULLUP_CONFIG1 PWR I3C PULL-UP Configuration Port A-B
  * @{
  */
#define LL_PWR_I3CPUCR1_PA1            PWR_I3CPUCR1_PA1_I3CPU                  /*!< I3C pull-up on PA1  */
#define LL_PWR_I3CPUCR1_PA6            PWR_I3CPUCR1_PA6_I3CPU                  /*!< I3C pull-up on PA6  */
#define LL_PWR_I3CPUCR1_PA7            PWR_I3CPUCR1_PA7_I3CPU                  /*!< I3C pull-up on PA7  */
#define LL_PWR_I3CPUCR1_PB2            PWR_I3CPUCR1_PB2_I3CPU                  /*!< I3C pull-up on PB2  */
#define LL_PWR_I3CPUCR1_PB6            PWR_I3CPUCR1_PB6_I3CPU                  /*!< I3C pull-up on PB6  */
#if defined(RAMCFG_SRAM3)
#define LL_PWR_I3CPUCR1_PB7            PWR_I3CPUCR1_PB7_I3CPU                  /*!< I3C pull-up on PB7  */
#endif /* defined(RAMCFG_SRAM3) */
#if defined(PWR_I3CPUCR1_PB8_I3CPU)
#define LL_PWR_I3CPUCR1_PB8            PWR_I3CPUCR1_PB8_I3CPU                  /*!< I3C pull-up on PB8  */
#define LL_PWR_I3CPUCR1_PB9            PWR_I3CPUCR1_PB9_I3CPU                  /*!< I3C pull-up on PB9  */
#endif /* PWR_I3CPUCR1_PB8_I3CPU */
#define LL_PWR_I3CPUCR1_PB10           PWR_I3CPUCR1_PB10_I3CPU                 /*!< I3C pull-up on PB10 */
#define LL_PWR_I3CPUCR1_PB12           PWR_I3CPUCR1_PB12_I3CPU                 /*!< I3C pull-up on PB12 */
#define LL_PWR_I3CPUCR1_PB13           PWR_I3CPUCR1_PB13_I3CPU                 /*!< I3C pull-up on PB13 */
#if defined(PWR_I3CPUCR1_PB8_I3CPU)
#define LL_PWR_I3CPUCR1_PB14           PWR_I3CPUCR1_PB14_I3CPU                 /*!< I3C pull-up on PB14 */
#endif /* PWR_I3CPUCR1_PB8_I3CPU */
#if defined(LL_PWR_I3CPUCR1_PB7)
#define LL_PWR_I3CPUCR1_ALL            (LL_PWR_I3CPUCR1_PA1  | LL_PWR_I3CPUCR1_PA6  | LL_PWR_I3CPUCR1_PA7  |\
                                        LL_PWR_I3CPUCR1_PB2  | LL_PWR_I3CPUCR1_PB6  | LL_PWR_I3CPUCR1_PB7  |\
                                        LL_PWR_I3CPUCR1_PB8  | LL_PWR_I3CPUCR1_PB9  | LL_PWR_I3CPUCR1_PB10 |\
                                        LL_PWR_I3CPUCR1_PB12 | LL_PWR_I3CPUCR1_PB13 | LL_PWR_I3CPUCR1_PB14)
#elif defined(PWR_I3CPUCR1_PB8_I3CPU)
#define LL_PWR_I3CPUCR1_ALL            (LL_PWR_I3CPUCR1_PA1  | LL_PWR_I3CPUCR1_PA6  | LL_PWR_I3CPUCR1_PA7  |\
                                        LL_PWR_I3CPUCR1_PB2  | LL_PWR_I3CPUCR1_PB6  | LL_PWR_I3CPUCR1_PB8  |\
                                        LL_PWR_I3CPUCR1_PB9  | LL_PWR_I3CPUCR1_PB10 | LL_PWR_I3CPUCR1_PB12 |\
                                        LL_PWR_I3CPUCR1_PB13 | LL_PWR_I3CPUCR1_PB14)
#else
#define LL_PWR_I3CPUCR1_ALL            (LL_PWR_I3CPUCR1_PA1  | LL_PWR_I3CPUCR1_PA6  | LL_PWR_I3CPUCR1_PA7  |\
                                        LL_PWR_I3CPUCR1_PB2  | LL_PWR_I3CPUCR1_PB6  | LL_PWR_I3CPUCR1_PB10 |\
                                        LL_PWR_I3CPUCR1_PB12 | LL_PWR_I3CPUCR1_PB13)
#endif /* defined-LL_PWR_I3CPUCR1_PB7) */
/*!<  I3C pull-up all for port A-B */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_I3C_PULLUP_CONFIG2 PWR I3C PULL-UP Configuration Port C-D-G-H
  * @{
  */
#if defined(PWR_I3CPUCR2_PC0_I3CPU)
#define LL_PWR_I3CPUCR2_PC0            PWR_I3CPUCR2_PC0_I3CPU                  /*!< I3C pull-up on PC0  */
#endif /* defined(PWR_I3CPUCR2_PC0_I3CPU) */
#define LL_PWR_I3CPUCR2_PC1            PWR_I3CPUCR2_PC1_I3CPU                  /*!< I3C pull-up on PC1  */
#define LL_PWR_I3CPUCR2_PD12           PWR_I3CPUCR2_PD12_I3CPU                 /*!< I3C pull-up on PD12 */
#define LL_PWR_I3CPUCR2_PD13           PWR_I3CPUCR2_PD13_I3CPU                 /*!< I3C pull-up on PD13 */
#if defined(PWR_I3CPUCR2_PC0_I3CPU)
#define LL_PWR_I3CPUCR2_PG7            PWR_I3CPUCR2_PG7_I3CPU                  /*!< I3C pull-up on PG7  */
#define LL_PWR_I3CPUCR2_PG8            PWR_I3CPUCR2_PG8_I3CPU                  /*!< I3C pull-up on PG8  */
#define LL_PWR_I3CPUCR2_PG13           PWR_I3CPUCR2_PG13_I3CPU                 /*!< I3C pull-up on PG13 */
#define LL_PWR_I3CPUCR2_PG14           PWR_I3CPUCR2_PG14_I3CPU                 /*!< I3C pull-up on PG14 */
#endif /* defined(PWR_I3CPUCR2_PC0_I3CPU) */
#define LL_PWR_I3CPUCR2_PH3            PWR_I3CPUCR2_PH3_I3CPU                  /*!< I3C pull-up on PH3  */
#if defined(PWR_I3CPUCR2_PC0_I3CPU)
#define LL_PWR_I3CPUCR2_ALL            (LL_PWR_I3CPUCR2_PC0  | LL_PWR_I3CPUCR2_PC1  | LL_PWR_I3CPUCR2_PD12 |\
                                        LL_PWR_I3CPUCR2_PD13 | LL_PWR_I3CPUCR2_PG7  | LL_PWR_I3CPUCR2_PG8  |\
                                        LL_PWR_I3CPUCR2_PG13 | LL_PWR_I3CPUCR2_PG14 | LL_PWR_I3CPUCR2_PH3)
#else
#define LL_PWR_I3CPUCR2_ALL            (LL_PWR_I3CPUCR2_PC1  | LL_PWR_I3CPUCR2_PD12 | LL_PWR_I3CPUCR2_PH3)
#endif /* defined(PWR_I3CPUCR2_PC0_I3CPU) */
/*!<  I3C pull-up all for port C-D-G-H */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_ITEMS_SECURE_ATTRIBUTE PWR Items Secure Attribute
  * @{
  */
#define LL_PWR_WAKEUP_LINE1_NSEC       (0U)                 /*!< Wake up line 1 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE1_SEC        PWR_SECCFGR_WUP1SEC  /*!< Wake up line 1 secure mode                    */
#define LL_PWR_WAKEUP_LINE2_NSEC       (0U)                 /*!< Wake up line 2 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE2_SEC        PWR_SECCFGR_WUP2SEC  /*!< Wake up line 2 secure mode                    */
#define LL_PWR_WAKEUP_LINE3_NSEC       (0U)                 /*!< Wake up line 3 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE3_SEC        PWR_SECCFGR_WUP3SEC  /*!< Wake up line 3 secure mode                    */
#define LL_PWR_WAKEUP_LINE4_NSEC       (0U)                 /*!< Wake up line 4 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE4_SEC        PWR_SECCFGR_WUP4SEC  /*!< Wake up line 4 secure mode                    */
#define LL_PWR_WAKEUP_LINE5_NSEC       (0U)                 /*!< Wake up line 5 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE5_SEC        PWR_SECCFGR_WUP5SEC  /*!< Wake up line 5 secure mode                    */
#define LL_PWR_WAKEUP_LINE6_NSEC       (0U)                 /*!< Wake up line 6 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE6_SEC        PWR_SECCFGR_WUP6SEC  /*!< Wake up line 6 secure mode                    */
#define LL_PWR_WAKEUP_LINE7_NSEC       (0U)                 /*!< Wake up line 7 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE7_SEC        PWR_SECCFGR_WUP7SEC  /*!< Wake up line 7 secure mode                    */
#define LL_PWR_WAKEUP_LINE8_NSEC       (0U)                 /*!< Wake up line 8 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE8_SEC        PWR_SECCFGR_WUP8SEC  /*!< Wake up line 8 secure mode                    */
#define LL_PWR_WAKEUP_LINE9_NSEC       (0U)                 /*!< Wake up line 9 nsecure mode                   */
#define LL_PWR_WAKEUP_LINE9_SEC        PWR_SECCFGR_WUP9SEC  /*!< Wake up line 9 secure mode                    */
#define LL_PWR_WAKEUP_LINE10_NSEC      (0U)                 /*!< Wake up line 10 nsecure mode                  */
#define LL_PWR_WAKEUP_LINE10_SEC       PWR_SECCFGR_WUP10SEC /*!< Wake up line 10 secure mode                   */
#define LL_PWR_LPM_NSEC                (0U)                 /*!< Low-power modes nsecure mode                  */
#define LL_PWR_LPM_SEC                 PWR_SECCFGR_LPMSEC   /*!< Low-power modes secure mode                   */
#define LL_PWR_VDM_NSEC                (0U)                 /*!< Voltage detection and monitoring nsecure mode */
#define LL_PWR_VDM_SEC                 PWR_SECCFGR_VDMSEC   /*!< Voltage detection and monitoring secure mode  */
#define LL_PWR_VB_NSEC                 (0U)                 /*!< Backup domain nsecure mode                    */
#define LL_PWR_VB_SEC                  PWR_SECCFGR_VBSEC    /*!< Backup domain secure mode                     */
#define LL_PWR_APC_NSEC                (0U)                 /*!< Pull-up/pull-down nsecure mode                */
#define LL_PWR_APC_SEC                 PWR_SECCFGR_APCSEC   /*!< Pull-up/pull-down secure mode                 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup PWR_LL_Exported_Macros PWR Exported Macros
  * @{
  */

/** @defgroup PWR_LL_EM_WRITE_READ Common Write and Read Registers Macros
  * @{
  */

/**
  * @brief  Write a value in PWR register.
  * @param  __REG__      Register to be written.
  * @param  __VALUE__    Value to be written in the register.
  * @retval None.
  */
#define LL_PWR_WriteReg(__REG__, __VALUE__) WRITE_REG(PWR->__REG__, (__VALUE__))

/**
  * @brief  Read a value in PWR register.
  * @param  __REG__      Register to be read.
  * @retval Register value.
  */
#define LL_PWR_ReadReg(__REG__) READ_REG(PWR->__REG__)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

