stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_pwr.h
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_LL_EF_CONFIGURATION PWR Configuration
  * @{
  */

/**
  * @brief  Set system power mode.
  * @rmtoll CR1              LPMS          LL_PWR_SetPowerMode
  * @param  Mode  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_MODE_STOP0
  *         @arg @ref LL_PWR_MODE_STOP1
  *         @arg @ref LL_PWR_MODE_STOP2
  *         @arg @ref LL_PWR_MODE_STOP3
  *         @arg @ref LL_PWR_MODE_STANDBY
  *         @arg @ref LL_PWR_MODE_SHUTDOWN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPowerMode(uint32_t Mode)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_LPMS, Mode);
}

/**
  * @brief  Get system power mode.
  * @rmtoll CR1              LPMS          LL_PWR_GetPowerMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_MODE_STOP0
  *         @arg @ref LL_PWR_MODE_STOP1
  *         @arg @ref LL_PWR_MODE_STOP2
  *         @arg @ref LL_PWR_MODE_STOP3
  *         @arg @ref LL_PWR_MODE_STANDBY
  *         @arg @ref LL_PWR_MODE_SHUTDOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetPowerMode(void)
{
  return (READ_BIT(PWR->CR1, PWR_CR1_LPMS));
}

/**
  * @brief  Enable SRAM1 power down.
  * @rmtoll CR1          SRAM1PD        LL_PWR_EnableSRAM1PowerDown
  * @retval None
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSRAM1PowerDown(void)
{
  /* SRAM1 powered off */
  SET_BIT(PWR->CR1, PWR_CR1_SRAM1PD);
}

/**
  * @brief  Disable SRAM1 power down.
  * @rmtoll CR1          SRAM1PD        LL_PWR_DisableSRAM1PowerDown
  * @retval None
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSRAM1PowerDown(void)
{
  /* SRAM1 powered on */
  CLEAR_BIT(PWR->CR1, PWR_CR1_SRAM1PD);
}

/**
  * @brief  Check if SRAM1 power down is enabled.
  * @rmtoll CR1          SRAM1PD        LL_PWR_IsEnabledSRAM1PowerDown
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM1PowerDown(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_SRAM1PD) == (PWR_CR1_SRAM1PD)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SRAM2 power down.
  * @rmtoll CR1          SRAM2PD        LL_PWR_EnableSRAM2PowerDown
  * @retval None
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSRAM2PowerDown(void)
{
  /* SRAM2 powered off */
  SET_BIT(PWR->CR1, PWR_CR1_SRAM2PD);
}

/**
  * @brief  Disable SRAM2 power down.
  * @rmtoll CR1          SRAM2PD        LL_PWR_DisableSRAM2PowerDown
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSRAM2PowerDown(void)
{
  /* SRAM2 powered on */
  CLEAR_BIT(PWR->CR1, PWR_CR1_SRAM2PD);
}

/**
  * @brief  Check if SRAM2 power down is enabled.
  * @rmtoll CR1          SRAM2PD        LL_PWR_IsEnabledSRAM2PowerDown
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM2PowerDown(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_SRAM2PD) == (PWR_CR1_SRAM2PD)) ? 1UL : 0UL);
}

/**
  * @brief  Set the SRAM2 page(s) retention in Standby mode.
  * @rmtoll CR1              RRSB1         LL_PWR_SetSRAM2SBRetention
  * @rmtoll CR1              RRSB2         LL_PWR_SetSRAM2SBRetention
  * @rmtoll CR1              RRSB3         LL_PWR_SetSRAM2SBRetention
  * @param  SRAM2PageRetention  This parameter can be one of the following values:
  *                              @arg @ref LL_PWR_SRAM2_SB_NO_RETENTION
  *                              @arg @ref LL_PWR_SRAM2_SB_PAGE1_RETENTION
  *                              @arg @ref LL_PWR_SRAM2_SB_PAGE2_RETENTION
  *                              @arg @ref LL_PWR_SRAM2_SB_PAGE3_RETENTION
  *                              @arg @ref LL_PWR_SRAM2_SB_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM2SBRetention(uint32_t SRAM2PageRetention)
{
  MODIFY_REG(PWR->CR1, (PWR_CR1_RRSB1 | PWR_CR1_RRSB2 | PWR_CR1_RRSB3), SRAM2PageRetention);
}

/**
  * @brief  Get the SRAM2 page(s) retention in Standby mode.
  * @rmtoll CR1              RRSB1         LL_PWR_GetSRAM2SBRetention
  * @rmtoll CR1              RRSB2         LL_PWR_GetSRAM2SBRetention
  * @rmtoll CR1              RRSB3         LL_PWR_GetSRAM2SBRetention
  * @retval Returned value can be one of the following values:
  *                              @arg @ref LL_PWR_SRAM2_SB_NO_RETENTION
  *                              @arg @ref LL_PWR_SRAM2_SB_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM2SBRetention(void)
{
  return (READ_BIT(PWR->CR1, PWR_CR1_RRSB1 | PWR_CR1_RRSB2 | PWR_CR1_RRSB3));
}

#if defined(RAMCFG_SRAM3)
#if defined(PWR_CR1_SRAM3PD)
/**
  * @brief  Enable SRAM3 power down.
  * @rmtoll CR1          SRAM3PD        LL_PWR_EnableSRAM3PowerDown
  * @retval None
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSRAM3PowerDown(void)
{
  /* SRAM3 powered off */
  SET_BIT(PWR->CR1, PWR_CR1_SRAM3PD);
}

/**
  * @brief  Disable SRAM3 power down.
  * @rmtoll CR1          SRAM3PD        LL_PWR_DisableSRAM3PowerDown
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSRAM3PowerDown(void)
{
  /* SRAM3 powered on */
  CLEAR_BIT(PWR->CR1, PWR_CR1_SRAM3PD);
}

/**
  * @brief  Check if SRAM3 power down is enabled.
  * @rmtoll CR1          SRAM3PD        LL_PWR_IsEnabledSRAM3PowerDown
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM3PowerDown(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_SRAM3PD) == (PWR_CR1_SRAM3PD)) ? 1UL : 0UL);
}
#endif /* defined(PWR_CR1_SRAM3PD) */

#if defined(PWR_CR1_SRAM4PD)
/**
  * @brief  Enable SRAM4 power down.
  * @rmtoll CR1          SRAM4PD        LL_PWR_EnableSRAM4PowerDown
  * @retval None
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSRAM4PowerDown(void)
{
  /* SRAM4 powered off */
  SET_BIT(PWR->CR1, PWR_CR1_SRAM4PD);
}

/**
  * @brief  Disable SRAM4 power down.
  * @rmtoll CR1          SRAM4PD        LL_PWR_DisableSRAM4PowerDown
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSRAM4PowerDown(void)
{
  /* SRAM4 powered on */
  CLEAR_BIT(PWR->CR1, PWR_CR1_SRAM4PD);
}

/**
  * @brief  Check if SRAM4 power down is enabled.
  * @rmtoll CR1          SRAM4PD        LL_PWR_IsEnabledSRAM4PowerDown
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM4PowerDown(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_SRAM4PD) == (PWR_CR1_SRAM4PD)) ? 1UL : 0UL);
}
#endif /* defined(PWR_CR1_SRAM4PD) */
#endif /* RAMCFG_SRAM3 */

/**
  * @brief  Enable BOR ultra low power mode.
  * @rmtoll CR1          UPLMEN        LL_PWR_EnableUltraLowPowerMode
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUltraLowPowerMode(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_ULPMEN);
}

/**
  * @brief  Disable BOR ultra low-power mode.
  * @rmtoll CR1          UPLMEN        LL_PWR_DisableUltraLowPowerMode
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUltraLowPowerMode(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_ULPMEN);
}

/**
  * @brief  Check if BOR ultra low power mode is enabled.
  * @rmtoll CR1          UPLMEN        LL_PWR_IsEnabledUltraLowPowerMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUltraLowPowerMode(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_ULPMEN) == (PWR_CR1_ULPMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the SRAM1 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM1PDSi       LL_PWR_SetSRAM1StopRetention
  * @param  SRAM1PageRetention  This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM1_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE2_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE3_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE4_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE5_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE6_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE7_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM1StopRetention(uint32_t SRAM1PageRetention)
{
  MODIFY_REG(PWR->CR2, LL_PWR_SRAM1_STOP_FULL_RETENTION, ((~SRAM1PageRetention) & LL_PWR_SRAM1_STOP_FULL_RETENTION));
}

/**
  * @brief  Get the SRAM1 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM1PDSi       LL_PWR_GetSRAM1StopRetention
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM1_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE2_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE3_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE4_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE5_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE6_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_PAGE7_RETENTION
  *         @arg @ref LL_PWR_SRAM1_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM1StopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, LL_PWR_SRAM1_STOP_FULL_RETENTION))) & LL_PWR_SRAM1_STOP_FULL_RETENTION);
}

/**
  * @brief  Set the SRAM2 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM2PDSi       LL_PWR_SetSRAM2StopRetention
  * @param  SRAM2PageRetention  This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM2_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE2_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE3_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM2StopRetention(uint32_t SRAM2PageRetention)
{
  MODIFY_REG(PWR->CR2, LL_PWR_SRAM2_STOP_FULL_RETENTION, ((~SRAM2PageRetention) & LL_PWR_SRAM2_STOP_FULL_RETENTION));
}

/**
  * @brief  Get the SRAM2 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM2PDSi       LL_PWR_GetSRAM2StopRetention
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM2_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE2_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE3_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM2StopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, LL_PWR_SRAM2_STOP_FULL_RETENTION))) & LL_PWR_SRAM2_STOP_FULL_RETENTION);
}

#if defined(RAMCFG_SRAM3)
/**
  * @brief  Set the SRAM3 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM3PDS       LL_PWR_SetSRAM3StopRetention
  * @param  SRAM3PageRetention  This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM3_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE2_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE3_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE4_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE5_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM3StopRetention(uint32_t SRAM3PageRetention)
{
  MODIFY_REG(PWR->CR2, LL_PWR_SRAM3_STOP_FULL_RETENTION, ((~SRAM3PageRetention) & LL_PWR_SRAM3_STOP_FULL_RETENTION));
}

/**
  * @brief  Get the SRAM3 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM3PDSi       LL_PWR_GetSRAM3StopRetention
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM3_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE2_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE3_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE4_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_PAGE5_RETENTION
  *         @arg @ref LL_PWR_SRAM3_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM3StopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, LL_PWR_SRAM3_STOP_FULL_RETENTION))) & LL_PWR_SRAM3_STOP_FULL_RETENTION);
}

/**
  * @brief  Set the SRAM4 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM4PDS       LL_PWR_SetSRAM4StopRetention
  * @param  SRAM4PageRetention  This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM4_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM4_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM4StopRetention(uint32_t SRAM4PageRetention)
{
  MODIFY_REG(PWR->CR2, LL_PWR_SRAM4_STOP_FULL_RETENTION, ((~SRAM4PageRetention) & LL_PWR_SRAM4_STOP_FULL_RETENTION));
}

/**
  * @brief  Get the SRAM4 page(s) retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    SRAM4PDSi       LL_PWR_GetSRAM4StopRetention
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_PWR_SRAM4_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_SRAM4_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM4StopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, LL_PWR_SRAM4_STOP_FULL_RETENTION))) & LL_PWR_SRAM4_STOP_FULL_RETENTION);
}
#endif /* RAMCFG_SRAM3 */

/**
  * @brief  Set the PKA SRAM retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    PKARAMPDS       LL_PWR_SetPKARAMStopRetention
  * @param  Retention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PKARAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_PKARAM_STOP_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPKARAMStopRetention(uint32_t Retention)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_PKARAMPDS,
             ((~Retention) & PWR_CR2_PKARAMPDS));
}

/**
  * @brief  Get the PKA SRAM retention in Stop modes (Stop 0, 1, 2, 3).
  * @rmtoll CR2    PKARAMPDS       LL_PWR_GetPKARAMStopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_PKARAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_PKARAM_STOP_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetPKARAMStopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_PKARAMPDS))) & PWR_CR2_PKARAMPDS);
}

/**
  * @brief  Set the FDCAN and USB SRAM power-down in Stop modes (Stop 0,1,2,3).
  * @rmtoll CR2    PRAMPDS       LL_PWR_SetFDCANUSBRAMStopRetention
  * @param  Retention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_FDCANUSBRAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_FDCANUSBRAM_STOP_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetFDCANUSBRAMStopRetention(uint32_t Retention)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_PRAMPDS,
             ((~Retention) & PWR_CR2_PRAMPDS));
}

/**
  * @brief  Get the PKA SRAM retention in Stop mode.
  * @rmtoll CR2    PRAMPDS       LL_PWR_GetFDCANUSBRAMStopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_FDCANUSBRAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_FDCANUSBRAM_STOP_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetFDCANUSBRAMStopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_PRAMPDS))) & PWR_CR2_PRAMPDS);
}

/**
  * @brief  Set the ICACHE SRAM retention in Stop mode.
  * @rmtoll CR2    ICRAMPDS       LL_PWR_SetICacheRAMStopRetention
  * @param  Retention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_ICACHERAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_ICACHERAM_STOP_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetICacheRAMStopRetention(uint32_t Retention)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_ICRAMPDS,
             ((~Retention) & PWR_CR2_ICRAMPDS));
}

/**
  * @brief  Get the ICACHE SRAM retention in Stop mode.
  * @rmtoll CR2    ICRAMPDS       LL_PWR_GetICacheRAMStopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_ICACHERAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_ICACHERAM_STOP_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetICacheRAMStopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_ICRAMPDS))) & PWR_CR2_ICRAMPDS);
}


/**
  * @brief  Enable the flash memory fast wakeup from Stop mode (Stop 0, 1).
  * @rmtoll CR2    FLASHFWU       LL_PWR_EnableFlashFastWakeUp
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableFlashFastWakeUp(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_FLASHFWU);
}

/**
  * @brief  Disable the flash memory fast wakeup from Stop mode (Stop 0, 1).
  * @rmtoll CR2    FLASHFWU       LL_PWR_DisableFlashFastWakeUp
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableFlashFastWakeUp(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_FLASHFWU);
}

/**
  * @brief  Check if the flash memory fast wakeup from Stop mode (Stop 0, 1)
  *         is enabled.
  * @rmtoll CR2    FLASHFWU       LL_PWR_IsEnabledFlashFastWakeUp
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledFlashFastWakeUp(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_FLASHFWU) == (PWR_CR2_FLASHFWU)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the SRAM memory fast wakeup from Stop mode (Stop 0, 1).
  * @rmtoll CR2    SRAMFWU       LL_PWR_EnableSRAMFastWakeUp
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSRAMFastWakeUp(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_SRAMFWU);
}

/**
  * @brief  Disable the SRAM memory fast wakeup from Stop mode (Stop 0, 1).
  * @rmtoll CR2    SRAMFWU       LL_PWR_DisableSRAMFastWakeUp
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSRAMFastWakeUp(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_SRAMFWU);
}

/**
  * @brief  Check if the SRAM memory fast wakeup from Stop mode (Stop 0, 1)
  *         is enabled.
  * @rmtoll CR2    SRAMFWU       LL_PWR_IsEnabledSRAMFastWakeUp
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAMFastWakeUp(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_SRAMFWU) == (PWR_CR2_SRAMFWU)) ? 1UL : 0UL);
}

#if defined(PWR_CR3_REGSEL)
/**
  * @brief  Set the VCore regulator supply.
  * @rmtoll CR3    REGSEL       LL_PWR_SetRegulatorSupply
  * @param  RegulatorSupply This parameter can be one of the following values:
  *         @arg @ref LL_PWR_LDO_SUPPLY
  *         @arg @ref LL_PWR_SMPS_SUPPLY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRegulatorSupply(uint32_t RegulatorSupply)
{
  MODIFY_REG(PWR->CR3, PWR_CR3_REGSEL, RegulatorSupply);
}

/**
  * @brief  Get the VCore regulator supply.
  * @rmtoll CR3    REGSEL       LL_PWR_GetRegulatorSupply
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_LDO_SUPPLY
  *         @arg @ref LL_PWR_SMPS_SUPPLY
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulatorSupply(void)
{
  return (READ_BIT(PWR->CR3, PWR_CR3_REGSEL));
}
#endif /* PWR_CR3_REGSEL */

/**
  * @brief  Enable the fast soft start for selected regulator.
  * @rmtoll CR3    FSTEN       LL_PWR_EnableFastSoftStart
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableFastSoftStart(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_FSTEN);
}

/**
  * @brief  Disable the fast soft start for selected regulator.
  * @rmtoll CR3    FSTEN       LL_PWR_DisableFastSoftStart
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableFastSoftStart(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_FSTEN);
}

/**
  * @brief  Check if the fast soft start for selected regulator is enabled.
  * @rmtoll CR3    FSTEN       LL_PWR_IsEnabledFastSoftStart
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledFastSoftStart(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_FSTEN) == (PWR_CR3_FSTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the regulator supply output voltage.
  * @note   R1EN and R2EN must be at opposite value.
  *         Any attempt to write R1EN and R2EN to same value is ignored.
  *         Modifying R1EN and R2EN is possible only when current range is
  *         ready (R1RDY=R1EN and R2RDY=R2EN).
  * @rmtoll VOSR          R1EN           LL_PWR_SetRegulVoltageScaling
  * @rmtoll VOSR          R2EN           LL_PWR_SetRegulVoltageScaling
  * @param  VoltageScaling This parameter can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRegulVoltageScaling(uint32_t VoltageScaling)
{
  MODIFY_REG(PWR->VOSR, PWR_VOSR_R1EN | PWR_VOSR_R2EN, VoltageScaling);
}

/**
  * @brief  Get the regulator supply output voltage.
  * @rmtoll VOSR          R1EN           LL_PWR_SetRegulVoltageScaling
  * @rmtoll VOSR          R2EN           LL_PWR_SetRegulVoltageScaling
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE2
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulVoltageScaling(void)
{
  return (uint32_t)(READ_BIT(PWR->VOSR, PWR_VOSR_R1EN | PWR_VOSR_R2EN));
}

/**
  * @brief  Enable the EPOD (Embedded Power Distribution) booster.
  * @rmtoll VOSR    BOOSTEN       LL_PWR_EnableEPODBooster
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableEPODBooster(void)
{
  SET_BIT(PWR->VOSR, PWR_VOSR_BOOSTEN);
}

/**
  * @brief  Disable the EPOD (Embedded Power Distribution) booster.
  * @rmtoll VOSR    BOOSTEN       LL_PWR_DisableEPODBooster
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableEPODBooster(void)
{
  CLEAR_BIT(PWR->VOSR, PWR_VOSR_BOOSTEN);
}

/**
  * @brief  Check if  the EPOD (Embedded Power Distribution) booster is enabled.
  * @rmtoll VOSR    BOOSTEN       LL_PWR_IsEnabledEPODBooster
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledEPODBooster(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_BOOSTEN) == (PWR_VOSR_BOOSTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Get currently voltage scaling applied to VCORE.
  * @rmtoll VOSR             R1RDY      LL_PWR_GetRegulCurrentVOS
  * @rmtoll VOSR             R2RDY      LL_PWR_GetRegulCurrentVOS
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE2
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulCurrentVOS(void)
{
  return (uint32_t)((READ_BIT(PWR->VOSR, PWR_VOSR_R1RDY | PWR_VOSR_R2RDY) >> PWR_VOSR_R1RDY_Pos));
}

/**
  * @brief  Set the Power voltage detector level.
  * @rmtoll SVMCR    PVDLS         LL_PWR_SetPVDLevel
  * @param  PVDLevel This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPVDLevel(uint32_t PVDLevel)
{
  MODIFY_REG(PWR->SVMCR, PWR_SVMCR_PVDLS, PVDLevel);
}

/**
  * @brief  Get the Power voltage detector level.
  * @rmtoll SVMCR    PVDLS         LL_PWR_GetPVDLevel
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  */
__STATIC_INLINE uint32_t LL_PWR_GetPVDLevel(void)
{
  return (READ_BIT(PWR->SVMCR, PWR_SVMCR_PVDLS));
}

/**
  * @brief  Enable the power voltage detector.
  * @rmtoll SVMCR          PVDE          LL_PWR_EnablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->SVMCR, PWR_SVMCR_PVDE);
}

/**
  * @brief  Disable the power voltage detector.
  * @rmtoll SVMCR          PVDE          LL_PWR_DisablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->SVMCR, PWR_SVMCR_PVDE);
}

