stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_pwr.h
/**
  * @brief  Disable GPIO pull-down in Standby and Shutdown modes.
  * @rmtoll PDCRx        PDx        LL_PWR_DisableGPIOPullDown
  * @param  GPIOPort This parameter can be one of the following values:
  *         @arg @ref LL_PWR_GPIO_PORTA
  *         @arg @ref LL_PWR_GPIO_PORTB
  *         @arg @ref LL_PWR_GPIO_PORTC
  *         @arg @ref LL_PWR_GPIO_PORTD
  *         @arg @ref LL_PWR_GPIO_PORTE
  *         @arg @ref LL_PWR_GPIO_PORTG
  *         @arg @ref LL_PWR_GPIO_PORTH
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_GPIO_PIN_0
  *         @arg @ref LL_PWR_GPIO_PIN_1
  *         @arg @ref LL_PWR_GPIO_PIN_2
  *         @arg @ref LL_PWR_GPIO_PIN_3
  *         @arg @ref LL_PWR_GPIO_PIN_4
  *         @arg @ref LL_PWR_GPIO_PIN_5
  *         @arg @ref LL_PWR_GPIO_PIN_6
  *         @arg @ref LL_PWR_GPIO_PIN_7
  *         @arg @ref LL_PWR_GPIO_PIN_8
  *         @arg @ref LL_PWR_GPIO_PIN_9
  *         @arg @ref LL_PWR_GPIO_PIN_10
  *         @arg @ref LL_PWR_GPIO_PIN_11
  *         @arg @ref LL_PWR_GPIO_PIN_12
  *         @arg @ref LL_PWR_GPIO_PIN_13
  *         @arg @ref LL_PWR_GPIO_PIN_14
  *         @arg @ref LL_PWR_GPIO_PIN_15
  * @retval None.
  */
__STATIC_INLINE void LL_PWR_DisableGPIOPullDown(uint32_t GPIOPort, uint32_t GPIOPin)
{
  CLEAR_BIT(*((__IO uint32_t *)(GPIOPort + 4U)), GPIOPin);
}

/**
  * @brief  Check if GPIO pull-down in Standby and Shutdown modes is enabled
  * @rmtoll PDCRx        PDx        LL_PWR_IsEnabledGPIOPullDown
  * @param  GPIOPort This parameter can be one of the following values:
  *         @arg @ref LL_PWR_GPIO_PORTA
  *         @arg @ref LL_PWR_GPIO_PORTB
  *         @arg @ref LL_PWR_GPIO_PORTC
  *         @arg @ref LL_PWR_GPIO_PORTD
  *         @arg @ref LL_PWR_GPIO_PORTE
  *         @arg @ref LL_PWR_GPIO_PORTG
  *         @arg @ref LL_PWR_GPIO_PORTH
  * @param  GPIOPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_GPIO_PIN_0
  *         @arg @ref LL_PWR_GPIO_PIN_1
  *         @arg @ref LL_PWR_GPIO_PIN_2
  *         @arg @ref LL_PWR_GPIO_PIN_3
  *         @arg @ref LL_PWR_GPIO_PIN_4
  *         @arg @ref LL_PWR_GPIO_PIN_5
  *         @arg @ref LL_PWR_GPIO_PIN_6
  *         @arg @ref LL_PWR_GPIO_PIN_7
  *         @arg @ref LL_PWR_GPIO_PIN_8
  *         @arg @ref LL_PWR_GPIO_PIN_9
  *         @arg @ref LL_PWR_GPIO_PIN_10
  *         @arg @ref LL_PWR_GPIO_PIN_11
  *         @arg @ref LL_PWR_GPIO_PIN_12
  *         @arg @ref LL_PWR_GPIO_PIN_13
  *         @arg @ref LL_PWR_GPIO_PIN_14
  *         @arg @ref LL_PWR_GPIO_PIN_15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledGPIOPullDown(uint32_t GPIOPort, uint32_t GPIOPin)
{
  return ((READ_BIT(*((__IO uint32_t *)(GPIOPort + 4U)), GPIOPin) == (GPIOPin)) ? 1UL : 0UL);
}

/**
  * @brief  Set I3C pull-up configuration for GPIO on port A-B.
  * @rmtoll I3CPUCR1     PAx_I3CPU        LL_PWR_SetI3CPullUpConfig1
  * @rmtoll I3CPUCR1     PBx_I3CPU        LL_PWR_SetI3CPullUpConfig1
  * @param  Gpio  This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_I3CPUCR1_PA1
  *         @arg @ref LL_PWR_I3CPUCR1_PA6
  *         @arg @ref LL_PWR_I3CPUCR1_PA7
  *         @arg @ref LL_PWR_I3CPUCR1_PB2
  *         @arg @ref LL_PWR_I3CPUCR1_PB6
  *         @arg @ref LL_PWR_I3CPUCR1_PB8
  *         @arg @ref LL_PWR_I3CPUCR1_PB9
  *         @arg @ref LL_PWR_I3CPUCR1_PB10
  *         @arg @ref LL_PWR_I3CPUCR1_PB12
  *         @arg @ref LL_PWR_I3CPUCR1_PB13
  *         @arg @ref LL_PWR_I3CPUCR1_PB14
  *         @arg @ref LL_PWR_I3CPUCR1_ALL
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetI3CPullUpConfig1(uint32_t Gpio)
{
  MODIFY_REG(PWR->I3CPUCR1, LL_PWR_I3CPUCR1_ALL, Gpio);
}

/**
  * @brief  Get I3C pull-up configuration for GPIO on port A-B.
#if defined(RAMCFG_SRAM3)
#endif
  * @rmtoll I3CPUCR1     PAx_I3CPU        LL_PWR_GetI3CPullUpConfig1
  * @rmtoll I3CPUCR1     PBx_I3CPU        LL_PWR_GetI3CPullUpConfig1
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_PWR_I3CPUCR1_PA1
  *         @arg @ref LL_PWR_I3CPUCR1_PA6
  *         @arg @ref LL_PWR_I3CPUCR1_PA7
  *         @arg @ref LL_PWR_I3CPUCR1_PB2
  *         @arg @ref LL_PWR_I3CPUCR1_PB6
  *         @arg @ref LL_PWR_I3CPUCR1_PB8
  *         @arg @ref LL_PWR_I3CPUCR1_PB9
  *         @arg @ref LL_PWR_I3CPUCR1_PB10
  *         @arg @ref LL_PWR_I3CPUCR1_PB12
  *         @arg @ref LL_PWR_I3CPUCR1_PB13
  *         @arg @ref LL_PWR_I3CPUCR1_PB14
  *         @arg @ref LL_PWR_I3CPUCR1_ALL
  */
__STATIC_INLINE uint32_t LL_PWR_GetI3CPullUpConfig1(void)
{
  return (READ_BIT(PWR->I3CPUCR1, LL_PWR_I3CPUCR1_ALL));
}

/**
  * @brief  Set I3C pull-up configuration for GPIO on port C-D-G-H.
  * @rmtoll I3CPUCR2     PCx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @rmtoll I3CPUCR2     PDx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @rmtoll I3CPUCR2     PGx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @rmtoll I3CPUCR2     PHx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @param  Gpio  This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_I3CPUCR2_PC0
  *         @arg @ref LL_PWR_I3CPUCR2_PC1
  *         @arg @ref LL_PWR_I3CPUCR2_PD12
  *         @arg @ref LL_PWR_I3CPUCR2_PD13
  *         @arg @ref LL_PWR_I3CPUCR2_PG7
  *         @arg @ref LL_PWR_I3CPUCR2_PG8
  *         @arg @ref LL_PWR_I3CPUCR2_PG13
  *         @arg @ref LL_PWR_I3CPUCR2_PG14
  *         @arg @ref LL_PWR_I3CPUCR2_PH3
  *         @arg @ref LL_PWR_I3CPUCR2_ALL
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetI3CPullUpConfig2(uint32_t Gpio)
{
  MODIFY_REG(PWR->I3CPUCR2, LL_PWR_I3CPUCR2_ALL, Gpio);
}

/**
  * @brief  Get I3C pull-up configuration for GPIO on port C-D-G-H.
  * @rmtoll I3CPUCR2     PCx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @rmtoll I3CPUCR2     PDx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @rmtoll I3CPUCR2     PGx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @rmtoll I3CPUCR2     PHx_I3CPU        LL_PWR_GetI3CPullUpConfig2
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_PWR_I3CPUCR2_PC0
  *         @arg @ref LL_PWR_I3CPUCR2_PC1
  *         @arg @ref LL_PWR_I3CPUCR2_PD12
  *         @arg @ref LL_PWR_I3CPUCR2_PD13
  *         @arg @ref LL_PWR_I3CPUCR2_PG7
  *         @arg @ref LL_PWR_I3CPUCR2_PG8
  *         @arg @ref LL_PWR_I3CPUCR2_PG13
  *         @arg @ref LL_PWR_I3CPUCR2_PG14
  *         @arg @ref LL_PWR_I3CPUCR2_PH3
  *         @arg @ref LL_PWR_I3CPUCR2_ALL
  */
__STATIC_INLINE uint32_t LL_PWR_GetI3CPullUpConfig2(void)
{
  return (READ_BIT(PWR->I3CPUCR2, LL_PWR_I3CPUCR2_ALL));
}
/**
  * @}
  */

/** @defgroup PWR_LL_EF_FLAG_MANAGEMENT PWR FLAG Management
  * @{
  */

/**
  * @brief  Indicate whether the system was in standby mode or not.
  * @rmtoll SR          SBF          LL_PWR_IsActiveFlag_SB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_SB(void)
{
  return ((READ_BIT(PWR->SR, PWR_SR_SBF) == (PWR_SR_SBF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the system was in stop mode or not.
  * @rmtoll SR          STOPF          LL_PWR_IsActiveFlag_STOP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_STOP(void)
{
  return ((READ_BIT(PWR->SR, PWR_SR_STOPF) == (PWR_SR_STOPF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the EPOD (Embedded Power Distribution) booster is
  *         ready OR not.
  * @rmtoll VOSR   BOOSTRDY       LL_PWR_IsActiveFlag_BOOST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_BOOST(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_BOOSTRDY) == (PWR_VOSR_BOOSTRDY)) ? 1UL : 0UL);
}

